a = 0b101100 # 10進数では44
b = 0b110110 # 10進数では54
c = []

c.append(bin(a & b).count('1')) # 0b101100&0b110110 = 0b100100 = 2
c.append(bin(a | b).count('1')) # 0b101100|0b110110 = 0b111110 = 5
c.append(bin(a ^ b).count('1')) # 0b101100^0b110110 = 0b11010  = 3
c.append(bin(a >> 2).count('1')) # 0b101100>>2      = 0b1011   = 3
print(c)

'''
AND(&):論理積
    両方のビットが1のとき1
    a & bは0b100100

OR(|):論理和
    どちらかが1だと1
    a | bは0b111110

XOR(^):排他的論理和
    どちらか一方だけ1のとき1
    a ^ bは0b11010

右シフト(>>):ビットを右にnだけ移動
    左は0または符号で補う
    0b101100 >> 2 →  0b001011
'''
